[
  {
    "Name": "administrative",
    "Title": "University Administrative Jobs",
    "Description": "University administrative jobs are rewarding and challenging, but also diverse and dynamic. They require a high level of professionalism, interpersonal skills, and technical skills. ",
    "Keyword": "University Administrative Jobs. University Administrative positions",
    "content": "University administrative jobs are the roles that provide essential services and functions to the academic community. They include roles such as academic advisors, admissions officers, registrars, financial aid officers, librarians, and IT specialists. University administrative jobs  assist students, faculty, and staff with various aspects of their academic journey, such as registration, enrollment, graduation, transcripts, scholarships, research grants, and academic policies."
  },
  {
    "Name": "estates facilities management",
    "Title": "University Estates & Facilities Management Jobs",
    "Description": "If you think you have what it takes to be an academic estates or facilities manager, or if you want to learn more about these roles, you can browse the current opportunities.",
    "Keyword": "University estates facilities management Jobs. University estates facilities management positions",
    "content": "University estates and facilities management jobs ensure the safety, functionality, and sustainability of the buildings, grounds, and services of their universities. They can be estate managers, facilities managers, project managers, engineers, and technicians. University estates and facilities management jobs take care of planning, designing, constructing, operating, and maintaining the physical assets and resources of their institutions. "
  },
  {
    "break1": true,
    "Name": "alumni fundraising",
    "Title": "University Fundraising & Alumni Jobs",
    "Description": "You can find University Fundraising & Alumni Jobs from various regions, countries, and types of institutions. You can also filter your search by keywords, location, salary range, and date posted. ",
    "Keyword": "University Fundraising & Alumni Jobs. University Fundraising & Alumnil positions",
    "content": "University fundraising and alumni jobs are the roles that support the development and advancement of their institutions. University fundraising and alumni jobs are fundraising managers, development officers, alumni relations officers, and donor relations officers. University fundraising and alumni jobs are behind identifying, cultivating, soliciting, and stewarding donors and alumni who can provide financial and non-financial support to their institutions."
  },
  {
    "Name": "health wellbeing",
    "Title": "University Health & Wellbeing Jobs",
    "Description": "University Health & Wellbeing Jobs require a thorough knowledge of the policies and regulations affecting the higher education sector in a changing and diverse environment.",
    "Keyword": "University health and wellbeing Jobs. University health and wellbeing positions",
    "content": "University health and well-being jobs provide essential services and programs to enhance the physical, mental, and social well-being of their institutions. These academic positions contain health educators, counsellors, psychologists, nurses, and social workers. University health and wellbeing jobs provide information, advice, support, and referrals to students, staff, and the wider community on various health and wellbeing issues, such as stress management, mental health, sexual health, alcohol and drug use, nutrition, fitness, and more."
  },
  {
    "break1": true,
    "Name": "hospitality retail conferences events",
    "Title": "University Hospitality, Retail, Conferences & Events Jobs",
    "Description": "University hospitality, retail, conferences and events jobs are rewarding and challenging, but also diverse and dynamic.  ",
    "Keyword": "University hospitality retail conferences events Jobs. hospitality retail conferences events positions",
    "content": "University hospitality, retail, conferences, and events jobs enhance the experience and satisfaction of the academic community. University hospitality, retail, conferences, and events jobs consist of catering managers, retail managers, conference coordinators, and event planners. They are responsible for planning, managing, and delivering various hospitality, retail, conferences, and events activities, such as catering, accommodation, merchandising, exhibitions, seminars, workshops, festivals, and ceremonies."
  },
  {
    "Name": "international activities",
    "Title": "University International Activities Jobs",
    "Description": "If you think you have what it takes to get academic international activities jobs, or if you want to learn more about these roles.",
    "Keyword": "University international activities Jobs. academic international activities positions",
    "content": "University international activities jobs support the development and implementation of the international strategy and vision of their institutions. The higher ed jobs on this page encompass international relations managers, international student advisors, study abroad coordinators, and international partnerships officers. University international activities jobs run the international mobility, collaboration, and engagement of students, staff, and partners. "
  },
  {
    "break1": true,
    "Name": "it services",
    "Title": "University IT Services Jobs",
    "Description": "Our job board is updated regularly with new and exciting academic IT services jobs. Don’t miss this opportunity to take your career to the next level. ",
    "Keyword": "University IT Services jobs. University IT Services positions",
    "content": "University IT services jobs ensure the availability, reliability, and security of the IT infrastructure and applications: IT managers, network administrators, software developers, web designers, and help desk technicians. academic IT services jobs conduct designing, developing, maintaining, and troubleshooting the IT systems and services that support the teaching, learning, research, and administration activities of their institutions. "
  },
  {
    "Name": "laboratory clinical technician",
    "Title": "University Laboratory, Clinical & Technician Jobs",
    "Description": "University laboratory and clinical technician jobs are rewarding and challenging, but also diverse and dynamic. Go to University laboratory and clinical technician jobs and higher ed position today.",
    "Keyword": "University laboratory and clinical technician jobs. University laboratory and clinical technician positions",
    "content": "University laboratory and clinical technician jobs support the teaching, learning, and research activities of their institutions such as laboratory technicians, clinical technicians, and research assistants. University laboratory and clinical technician jobs are accountable for preparing, organising, conducting, and recording laboratory and clinical tests using a range of tools and equipment. "
  },
  {
    "Name": "legal compliance policy",
    "Title": "University Legal, Compliance policy Jobs",
    "Description": "University Legal, Compliance policy Jobs develop, review, and implement policies and procedures that reflect the mission, vision, and values of their institutions.",
    "Keyword": "University Legal, Compliance policy Jobs. University Legal, Compliance policy positions",
    "content": "University legal compliance and policy jobs govern the risk management of their institutions with positions like legal counsel, compliance officer, and policy officer. University legal compliance and policy jobs aid with legal advice, guidance, and representation to their institutions on various matters, such as contracts, disputes, regulations, and intellectual property."
  },
  {
    "Name": "library services data information management",
    "Title": "University Library Services, Data & Information Management Jobs",
    "Description": "University library services, data, and information management jobs work closely with the faculty, staff, and students to ensure the quality and accessibility of the information resources and data.",
    "Keyword": "University library services data information management Jobs. University library services data information management positions",
    "content": "University library services, data, and information management jobs are the librarians, data managers, information specialists, and archivists. University library services, data, and information management jobs see to collecting, organising, preserving, and disseminating the information resources and data that are relevant."
  },
  {
    "break1": true,
    "Name": "pr marketing sales communication",
    "Title": "University PR, Marketing, Sales & Communication Jobs",
    "Description": "Our job board is updated regularly with new and exciting academic PR, marketing, sales, and communication jobs.  ",
    "Keyword": "University pr marketing sales communication Jobs. academic pr marketing sales communication positions",
    "content": "University PR, marketing, sales, and communication jobs engage with PR managers, marketing managers, sales managers, and communication officers. University PR, marketing, sales, and communication jobs enter the PR, marketing, sales, and communication strategy and campaigns.."
  },
  {
    "Name": "project management consulting",
    "Title": "University Project Management & Consulting Jobs",
    "Description": "Do you have the skills, experience, and passion to communicate and promote the value and impact of a university or college? If so, you might want to check out the academic PR, marketing, sales, and communication jobs.",
    "Keyword": "University HR occupational health safety Jobs. HR occupational health safety positions",
    "content": "University project management and consulting jobs strategize planning, implementation, and evaluation of various projects and initiatives, including roles such as project managers, consultants, analysts, and coordinators. University project management and consulting jobs define the scope, objectives, deliverables, and outcomes of the projects and initiatives. They also manage the resources, budget, timeline, risks, and stakeholders of the projects. "
  },
  {
    "break1": true,
    "Name": "senior management",
    "Title": "University Senior Management Jobs",
    "Description": " University Senior Management Jobs oversee the quality and integrity of the academic programs, faculty, research, and student success. ",
    "Keyword": "University Senior Management Jobs. University Senior Management positions",
    "content": "University senior management jobs are the roles that provide strategic direction, operational oversight, and academic leadership to their institutions. University senior management jobs work closely with the governing bodies, external stakeholders, and the academic community to ensure excellence and sustainability. "
  },
  {
    "Name": "sports leisure",
    "Title": "University Sports & Leisure Jobs",
    "Description": "University Sports & Leisure Jobs must have the passion to teach, coach, or manage sports and leisure activities for students, staff, and the wider community.",
    "Keyword": "University Sports & Leisure Jobs. University Sports & Leisure positions",
    "content": "University sports and leisure jobs aid the physical, mental, and social well-being of the academic community through sports and leisure programs and services. These academic roles can include sports science lecturers, sports coaches, sports therapists, fitness instructors, and leisure managers. University sports and leisure jobs are responsible for designing, delivering, and evaluating various sports and leisure activities, such as fitness classes, team sports, outdoor adventures, recreational events, and wellness workshops."
  },
  {
    "break1": true,
    "Name": "student services",
    "Title": "University Student Services Jobs",
    "Description": "If you think you have what it takes to get academic student services jobs, you can browse the current opportunities on our job board. ",
    "Keyword": "University Student Services Jobs. University Student Services positions",
    "content": "University student services jobs develop and maintain programs designed to support and enhance the student experience and campus life such as student advisors, counselors, career consultants, disability support officers, and learning support officers. University student services jobs are in control of interacting with students and providing advice for personal and university-related inquiries, such as academic progress, well-being, financial assistance, employability, and engagement."
  },
  {
    "Name": "sustainability",
    "Title": "University Sustainability Jobs",
    "Description": "University sustainability jobs require the skills, experience, and passion to contribute to the environmental, social, and economic sustainability of a university or college.",
    "Keyword": "University sustainability jobs implement sustainability strategies and visions as sustainability managers, sustainability officers, sustainability educators, and sustainability researchers. University sustainability jobs decide on planning, managing, and delivering various sustainability initiatives, such as carbon reduction, waste management, energy efficiency, biodiversity, community engagement, and curriculum development."
  },
  {
    "Name": "web design development",
    "Title": "University Web Design & Development Jobs",
    "Description": "University web design and development jobs work with other senior leaders, such as provosts, deans, and directors, to ensure the alignment and integration of the web strategy with the institutional vision and goals.",
    "Keyword": "University web design and development jobs. University web design and development positions",
    "content": "University web design and development jobs can exist as web designers, web developers, web managers, and web analysts. University web design and development jobs are behind designing, developing, maintaining, and improving the websites, web applications, and web services that support teaching, learning, research, and administration activities."
  },
  {
    "Name": "other admin and support",
    "Title": "University Other Admin and Support Jobs",
    "Description": "University other admin and support Jobs require a thorough knowledge of the policies and regulations affecting the higher education sector in a changing and diverse environment.",
    "Keyword": "University other admin and support Jobs. University other admin and support positions",
    "content": "University other admin and support jobs provide essential services and functions to the academic community. They include roles such as receptionists, secretaries, assistants, coordinators, and officers, with tasks like data entry, record keeping, filing, scheduling, and reporting."
  }
]
