[


 {
  
   
  
  "Name": "generalist hr",
  "Title": "Academic Generalist HR Jobs",
  "Description": "If you are interested in applying for Academic generalist hr Jobs on academic job board, you can browse the current listings on Academic Jobs Board.",
  "Keyword": "Academic Generalist HR Jobs. Academic Generalist HR positions",
  "content": "Academic generalist HR jobs are positions that involve providing human resources support and services to academic staff and students in need. Academic generalist HR jobs are tasked with recruitment, performance management, employee relations, training and development, payroll, benefits, and compliance."
},
 {

  "Name": "industrial employee relations",
  "Title": "Academic Industrial & Employee Relations Jobs",
  "Description": "If you are ready to take the next step in your academic career, apply now for a professor job.",
  "Keyword": "Academic HR industrial employee relations Jobs. Academic HR industrial employee relations positions",
  "content": "Academic HR Industrial & Employee Relations Jobs conduct research, teaching, and consulting on various aspects of industrial and employee relations in academia. Academic HR Industrial & Employee Relations Jobs will be involved in topics such as employee voice and participation, collective bargaining, conflict resolution, diversity and inclusion, employment law, and workplace democracy. You will also contribute to the development of policies and practices that enhance the quality of work and employment for academic staff and students."
 },
 
 {   
  "break1": true,   
  "Name": "management internal",
  "Title": "Academic Management - Internal Jobs",
  "Description": "As an academic HR internal manager, you will have the opportunity to work with leading scholars and practitioners in the field. ",
  "Keyword": "Academic HR management internal Jobs. HR management internal positions",
  "content": "Academic HR management internal jobs lead the human resources functions and activities of a specific academic unit or department. Academic HR management internal jobs create HR policies and procedures, oversee recruitment and retention, manage performance and development, ensure compliance and equity, and foster a positive and inclusive work culture."
 },
 {
  "Name": "occupational health safety",
  "Title": "Academic Occupational Health & Safety Jobs",
  "Description": "As an academic HR occupational health safety job, you will have the opportunity toprovide occupational health and safety advice, support, and training",
  "Keyword": "Academic HR occupational health safety Jobs. HR occupational health safety positions",
  "content": "Academic HR occupational health safety jobs provide occupational health and safety advice, support, and training. Academic HR occupational health safety jobs involve risk assessments, developing and implementing safety policies and procedures, conducting audits and inspections, investigating incidents and injuries, and reporting on safety performance and compliance."
 },
 {
  "break1": true,   
  "Name": "organisational development",
  "Title": "Academic Organisational Development Jobs",
  "Description": "Academicjobs has hundreds of academic associate professor opportunities from leading universities, research institutes, and private companies. ",
  "Keyword": "Academic HR organisational development Jobs. HR organisational development positions",
  "content": "Academic HR organisational development jobs position organisational development services and solutions to universities. Academic HR organisational development jobs formulate organisational analysis and diagnosis, designing and facilitate change initiatives, develop and implement learning and development programs, evaluate and report on outcomes, and provide coaching and mentoring."
   
},
 
 {
  "Name": "recruitment internal",
  "Title": "Academic Recruitment - Internal Jobs",
  "Description": "Do you have the skills and experience to attract and hire the best academic talent for your institution? If so, you might be interested in applying for Academic HR recruitment internal jobs on academic job board.",
  "Keyword": "Academic HR recruitment internal Jobs. HR recruitment internal positions",
  "content": "Academic HR recruitment internal jobs manage the end-to-end recruitment process for academic staff and leaders in higher education institutions. Academic HR recruitment internal jobs develop and implement recruitment strategies, sourcing and screening candidates, conducting interviews and assessments, negotiating offers and contracts, and onboarding new hires."
 },
 {
  "break1": true,   
  "Name": "remuneration benefits",
  "Title": "Academic Remuneration & Benefits Jobs",
  "Description": "To be eligible for Academic HR remuneration benefits jobs on academic job board, you will need to have a bachelor’s degree or higher in human resources management, business administration, or a related field, as well as relevant work experience in remuneration and benefits. ",
  "Keyword": "Academic HR Remuneration & Benefits. HR Remuneration & Benefits positions",
  "content": "Academic HR remuneration benefits jobs give remuneration and benefits services and advice to academic units and departments. Academic HR remuneration benefits jobs conduct market research and benchmarking, develop and implement salary structures and policies, manage payroll and superannuation, oversee employee recognition and incentive schemes, and ensure compliance and equity."
 },
 {
  "Name": "training development",
  "Title": "Academic Training & Development Jobs",
  "Description": "The top university positions and professions in Academic Training & Development Jobs. Look for opportunities at universities, professions in training development, research, teaching, and faculty roles. Visit the higher education and academic training development employment pages right now.",
  "Keyword": "Academic Training & Development Jobs. Academic Training & Development positions",
  "content": "Academic HR training development jobs surround training and development services and solutions. Academic HR training development jobs will be responsible for tasks such as conducting training needs analysis, developing and implementing learning objectives and outcomes, designing and facilitating training sessions and workshops, evaluating and reporting on learning effectiveness, and providing coaching and feedback."
 }
 
]
 