[


 {
  
   
  
  "Name": "biological biomedical sciences",
  "Title": "Academic Biological & Biomedical Sciences industry jobs",
  "Description": "If you are looking for academic biological biomedical sciences industry jobs, you can browse through our job board.",
  "Keyword": "Academic Biological & Biomedical Sciences industry jobs. Academic Biological & Biomedical Sciences positions",
  "content": "Academic biological biomedical sciences industry jobs can cover molecular biology, biochemistry, biotechnology, cell biology, embryology, nanobiotechnology, biological engineering, laboratory medical biology, cytogenetics, genetics, gene therapy, bioinformatics, biostatistics, systems biology, neuroscience, microbiology, virology, immunology, parasitology, physiology, pathology, anatomy, toxicology." },
 {

  "Name": "biotechnology genetics",
  "Title": "Academic Biotechnology & Genetics industry jobs",
  "Description": "Academic biotechnology genetics industry jobs can cover a wide range of topics and disciplines, such as recombinant DNA technology, molecular cloning, gene therapy, genetic engineering,.",
  "Keyword": "Academic Biotechnology & Genetics industry jobs. Academic Biotechnology & Genetics positions",
  "content": "Academic Biotechnology and genetics industry jobs are closely related fields that use biological systems and processes to create or modify products, organisms, or traits. Academic Biotechnology and genetics industry jobs have many applications in medicine, agriculture, industry, and environmental protection. If you are fascinated by the potential of biotechnology and genetics to improve human health, food security, and biodiversity, you may want to pursue a career in these fields."  },
 
 {   
  "break1": true,   
  "Name": "chemistry physics",
  "Title": "Academic Chemistry & Physics industry jobs",
  "Description": "Some examples of academic chemistry physics fields are chemical physics, physical chemistry, quantum mechanics, nuclear physics / chemistry. ",
  "Keyword": "Academic Chemistry & Physics industry jobs. Academic Chemistry & Physics positions",
  "content": "Academic chemistry physics industry jobs are positions that involve industry industry jobs in a university or research institute setting. Academic chemistry physics industry jobs require a high level of expertise, creativity, and innovation, as well as the ability to communicate effectively with students, colleagues, and the public. Academic chemistry physics industry jobs can cover a wide range of topics and disciplines that explore the nature and mechanisms of matter and energy at various levels, from atoms and molecules to solids and liquids."  },
 {
  "Name": "environmental earth geosciences",
  "Title": "Academic Environmental, Earth & Geosciences industry jobs",
  "Description": "Academic environmental earth geosciences industry jobs are positions that involve teaching, research, or both, in a university or research institute setting.",
  "Keyword": "Academic Environmental, Earth & Geosciences industry jobs. Academic Environmental, Earth & Geosciences positions",
  "content": "Environmental earth geosciences industry jobs encompass a wide range of disciplines, such as geology, geography, hydrology, meteorology, climatology, oceanography, ecology, and biogeochemistry. Environmental earth geosciences industry jobs investigate the interactions between the biosphere, hydrosphere/cryosphere, atmosphere, and geosphere (or lithosphere) of the Earth"  },
 {
  "break1": true,   
  "Name": "laboratory technical services",
  "Title": "Academic Laboratory & Technical Services industry jobs",
  "Description": "If you are looking for academic laboratory technical services industry jobs, you can browse through our job board to find the latest opportunities in this essential and rewarding field. ",
  "Keyword": "Academic Laboratory & Technical Services industry jobs. Academic Laboratory & Technical Services positions",
  "content": "Academic laboratory technical services industry jobs can cover chemistry, physics, biology, biotechnology, genetics, environmental science, geoscience, engineering, and many others."    
},
 
 {
  "Name": "materials sciences",
  "Title": "Academic Materials Sciences industry jobs",
  "Description": "Academic materials sciences jobs can cover a wide range of topics and fields that explore the nature and mechanisms of matter and energy at various levels, from atoms and molecules to solids and liquids.",
  "Keyword": "Academic Materials Sciences industry jobs. Academic Materials Sciences positions",
  "content": "Some examples of academic materials sciences industry jobs are chemical physics, physical chemistry, quantum mechanics, nuclear physics/chemistry, materials science, spectroscopy, solid-state physics, solid-state chemistry, crystallography, and nanotechnology. If you are looking for academic materials sciences industry jobs, you can browse through our job board to find the latest opportunities."  },
 {
  "break1": true,   
  "Name": "mathematics statistics information sciences",
  "Title": "Academic Mathematics, Statistics & Information Sciences industry jobs",
  "Description": "These jobs require a high level of expertise, creativity, and innovation, as well as the ability to communicate effectively with students, colleagues, and the public.. ",
  "Keyword": "Academic Mathematics, Statistics & Information Sciences industry jobs. Academic Mathematics, Statistics & Information Sciences positions",
  "content": "Academic mathematics statistics information sciences industry jobs are mathematical analysis, linear algebra, stochastic analysis, differential equations, measure theory, probability theory, mathematical statistics, data science, computational science, computer science, operations research, econometrics, quantitative biology, control theory, and information theory."  },
 {
  "Name": "energy",
  "Title": "Academic Energy industry jobs",
  "Description": "Our job board is updated regularly with academic energy jobs from reputable institutions around the world. ",
  "Keyword": "Academic Energy industry jobs. Academic Academic Energy industry positions",
  "content": "Academic energy industry jobs can be in physics, chemistry, engineering, environmental science, geoscience, materials science, biotechnology, economics, policy, and management. Academic energy industry jobs investigate various aspects of energy generation, distribution, storage, consumption, efficiency, conservation, and environmental impact using techniques from natural and social sciences; they also apply this knowledge to solve problems in various domains such as industry, transportation, agriculture, health, and security"  }
 
]
 