[


 {
  
   
  
  "Name": "agriculture research",
  "Title": "Academic Agriculture research Jobs",
  "Description": "We have a wide range of agriculture research jobs available, from PhD, postdoctoral, fellowship and associate research roles.",
  "Keyword": "Academic Agriculture research Jobs. Academic Agriculture research positions",
  "content": "The academic agriculture research jobs on our job board are crop production, animal science, soil science, plant pathology, entomology, horticulture, and agribusiness." },
 {

  "Name": "business research",
  "Title": "Academic Business research Jobs",
  "Description": "Do you want to join the leading universities and institutions in Australia and beyond that are conducting cutting-edge research in the fields of accounting, finance, management, marketing, and economics.",
  "Keyword": "Academic Business research Jobs. Academic Business research positions",
"content": "Academic Business research Jobs explore corporate governance, financial markets, consumer behaviour, organisational change, or social entrepreneurship, we have something for you. You can browse through our listings of business research jobs by location, salary, work type, education level, and company. You can also create alerts and get notified of new opportunities that match your academic business research jobs."  },
 
 {   
    
  "Name": "communications research",
  "Title": "Academic Communications research Jobs",
  "Description": "Whether you are interested in digital media, social media, intercultural communication, public relations, or communication policy, we have something for you.  ",
  "Keyword": "Academic Communications research Jobs. Academic Communications research positions",
  "content": "Do you want to join academic Communications research jobs in the top universities and institutions around the world that are conducting innovative research in the fields of media, journalism, language, culture, and communication? If yes, browse our academic Communications research jobs on this page."  },
 {
  "Name": "education research",
  "Title": "Academic Education research Jobs",
  "Description": "If you are passionate about education research and want to make a difference in the world, don’t miss this chance to find your ideal job.",
  "Keyword": "Academic Education research Jobs. Academic Education research positions",
  "content": "Academic Education research Jobs investigates early childhood education, school education, higher education, vocational education, or adult education. Academic Education research Jobs can cover teaching, learning, curriculum, policy, and leadership"  },
 {
  
  "Name": "fine applied arts research",
  "Title": "Academic Fine Applied Arts Research Jobs",
  "Description": "We have a wide range of fine applied arts research jobs available, from PhD, postdoctoral, fellowship and associate research roles to lecturing. ",
  "Keyword": "Academic Fine Applied Arts research Jobs. Academic Fine Applied Arts research positions",
  "content": "Academic Health Sciences research Jobs, span visual arts, design, music, theatre, and film. Academic Health Sciences research Jobs can look over painting, sculpture, photography, graphic design, animation, sound design, performance art, or screenwriting."    
},
 
 {
  "Name": "health sciences research",
  "Title": "Academic Health Sciences research Jobs",
  "Description": "We also feature success stories and insights from academics who have landed their dream jobs in health sciences research.",
  "Keyword": "Academic Health Sciences research Jobs. Academic Health Sciences research positions",
  "content": "With academic Health Sciences research Jobs you can research clinical trials, epidemiology, health economics, health promotion, or health policy. On AcademicJobs you can find a meaningful and rewarding career with academic health sciences research jobs."  },
 {
    
  "Name": "law legal studies research",
  "Title": "Academic Law And Legal Studies research Jobs",
  "Description": "Whether you are interested in comparative law, environmental law, family law, intellectual property law, or legal history, we have something for you.  ",
  "Keyword": "Academic Law Legal Studies research Jobs. Academic Law Legal Studies research positions",
  "content": "Academic Law And Legal Studies research Jobs examine comparative law, environmental law, family law, intellectual property law, or legal history. Academic Law And Legal Studies research Jobs influence constitutional law, human rights, international law, criminal law, and legal theory? If yes, then you have come to the right place!"  },
 {
  "Name": "liberal arts research",
  "Title": "Academic Liberal Arts research Jobs",
  "Description": "We have a wide range of liberal arts research jobs available, from PhD, postdoctoral, fellowship and associate research roles to lecturing, management and specialist consultancy jobs.",
  "Keyword": "Academic Liberal Arts research Jobs. Academic Liberal Arts research positions",
  "content": "Academic Liberal Arts research Jobs consider the fields of humanities, social sciences, languages, creative arts, history, philosophy, literature, sociology, psychology, linguistics, or music. To apply for any of the academic liberal arts research jobs on our site, you will need to register with us. "  },
 {
  "Name": "medicine research",
  "Title": "Academic Medicine research Jobs",
  "Description": "If you are passionate about academic medicine research and want to make a difference in the world, don’t miss this chance to find your ideal job. ",
  "Keyword": "Academic Medicine research Jobs. Academic Medicine research positions",
  "content": "We have a wide range of academic medicine research jobs available, from PhD, postdoctoral, fellowship, and associate research roles to lecturing, management, and specialist consultancy jobs. Academic medicine research jobs can inspect molecular biology, immunology, neuroscience, cardiology, oncology, epidemiology, biomedical sciences, clinical sciences, public health, and health services."  },
 {
  
  "Name": "science research",
  "Title": "Academic Science research Jobs",
  "Description": "Whether you are interested in quantum mechanics, organic chemistry, molecular biology, statistics, or artificial intelligence, we have something for you. ",
  "Keyword": "Academic Science research Jobs. Academic Science research positions",
  "content": "Academic Science research Jobs pursue cutting-edge research in the fields of physics, chemistry, biology, mathematics, computer science, quantum mechanics, organic chemistry, molecular biology, statistics, or artificial intelligence. Academic Science research Jobs on our site are easy to find and secure, and we respect your privacy and confidentiality."  },
 {
  "Name": "technical career research",
  "Title": "Academic Technical Career research Jobs",
  "Description": "The greatest professions and occupations in entomology for university students. Look for opportunities at universities, professions in technical career, research, teaching, and faculty roles. Visit higher education positions and academic entomology jobs now.",
  "Keyword": "Academic Technical Career research Jobs. Academic Technical Career research positions",
  "content": "On AcademicJobs we have academic Technical Career research Jobs such as engineering, technology, applied sciences, civil engineering, electrical engineering, mechanical engineering, computer science, information technology, or nanotechnology. We also feature success stories and insights from academics who have landed their dream jobs in academic technical career research jobs."  }
 
]
 